## Staging: export 💾
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**❌ &nbsp; Terraform Format:** `failed`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**🧹 &nbsp; Format:** run `terraform fmt` to fix the following: 
```sh
tasks.tf
```
```terraform
Plan: 17 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                                                          NAME                                                                           |
|--------|---------------------------------------------------------------------------------------------------------------------------------------------------------|
| add    | `module.platform_gc_design_system_export.aws_cloudwatch_log_metric_filter.platform_gc_design_system`                                                    |
|        | `module.platform_gc_design_system_export.aws_cloudwatch_metric_alarm.platform_gc_design_system_error_logged`                                            |
|        | `module.platform_gc_design_system_export.aws_cloudwatch_metric_alarm.platform_gc_design_system_errors`                                                  |
|        | `module.platform_gc_design_system_export.aws_ssm_parameter.airtable_api_key`                                                                            |
|        | `module.platform_gc_design_system_export.module.platform_gc_design_system_export.aws_cloudwatch_event_rule.this`                                        |
|        | `module.platform_gc_design_system_export.module.platform_gc_design_system_export.aws_cloudwatch_event_target.this`                                      |
|        | `module.platform_gc_design_system_export.module.platform_gc_design_system_export.aws_ecr_lifecycle_policy.this[0]`                                      |
|        | `module.platform_gc_design_system_export.module.platform_gc_design_system_export.aws_lambda_permission.this`                                            |
|        | `module.platform_gc_design_system_export.module.platform_gc_design_system_export.module.this_lambda.aws_cloudwatch_log_group.this`                      |
|        | `module.platform_gc_design_system_export.module.platform_gc_design_system_export.module.this_lambda.aws_cloudwatch_query_definition.lambda_statistics`  |
|        | `module.platform_gc_design_system_export.module.platform_gc_design_system_export.module.this_lambda.aws_iam_policy.non_vpc_policies[0]`                 |
|        | `module.platform_gc_design_system_export.module.platform_gc_design_system_export.module.this_lambda.aws_iam_policy.policies[0]`                         |
|        | `module.platform_gc_design_system_export.module.platform_gc_design_system_export.module.this_lambda.aws_iam_role.this`                                  |
|        | `module.platform_gc_design_system_export.module.platform_gc_design_system_export.module.this_lambda.aws_iam_role_policy_attachment.attachments[0]`      |
|        | `module.platform_gc_design_system_export.module.platform_gc_design_system_export.module.this_lambda.aws_iam_role_policy_attachment.lambda_insights[0]`  |
|        | `module.platform_gc_design_system_export.module.platform_gc_design_system_export.module.this_lambda.aws_iam_role_policy_attachment.non_vpc_policies[0]` |
|        | `module.platform_gc_design_system_export.module.platform_gc_design_system_export.module.this_lambda.aws_lambda_function.this`                           |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.platform_gc_design_system_export.data.aws_iam_policy_document.platform_gc_design_system_export will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "platform_gc_design_system_export" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "ssm:GetParameter*",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "GetSSMParameters"
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:PutObject",
              + "s3:PutObjectAcl",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:s3:::cds-data-lake-raw-staging/platform/gc-design-system/airtable/*",
              + "arn:aws:s3:::cds-data-lake-transformed-staging/platform/gc-design-system/airtable/*",
            ]
          + sid       = "WriteToS3Bucket"
        }
      + statement {
          + actions   = [
              + "glue:GetCrawler",
              + "glue:StartCrawler",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:glue:ca-central-1:123456789012:crawler/mock-crawler-name",
            ]
          + sid       = "StartGlueCrawler"
        }
    }

  # module.platform_gc_design_system_export.aws_cloudwatch_log_metric_filter.platform_gc_design_system will be created
  + resource "aws_cloudwatch_log_metric_filter" "platform_gc_design_system" {
      + apply_on_transformed_logs = (known after apply)
      + id                        = (known after apply)
      + log_group_name            = "/aws/lambda/platform-gc-design-system-export"
      + name                      = "platform-gc-design-system-export-error"
      + pattern                   = "ERROR"
      + region                    = "ca-central-1"

      + metric_transformation {
          + default_value = "0"
          + name          = "platform-gc-design-system-export-error"
          + namespace     = "data-lake"
          + unit          = "Count"
          + value         = "1"
        }
    }

  # module.platform_gc_design_system_export.aws_cloudwatch_metric_alarm.platform_gc_design_system_error_logged will be created
  + resource "aws_cloudwatch_metric_alarm" "platform_gc_design_system_error_logged" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:454671348950:cloudwatch-alarm-action",
        ]
      + alarm_description                     = "Errors logged over 1 minute by the Platform / GC Design System export."
      + alarm_name                            = "platform-gc-design-system-export-error-logged"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "platform-gc-design-system-export-error"
      + namespace                             = "data-lake"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:454671348950:cloudwatch-ok-action",
        ]
      + period                                = 60
      + region                                = "ca-central-1"
      + statistic                             = "Sum"
      + tags_all                              = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
      + threshold                             = 0
      + treat_missing_data                    = "notBreaching"
    }

  # module.platform_gc_design_system_export.aws_cloudwatch_metric_alarm.platform_gc_design_system_errors will be created
  + resource "aws_cloudwatch_metric_alarm" "platform_gc_design_system_errors" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:454671348950:cloudwatch-alarm-action",
        ]
      + alarm_description                     = "Errors metric over 1 minute by the Platform / GC Design System export."
      + alarm_name                            = "platform-gc-design-system-export-errors"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "FunctionName" = "platform-gc-design-system-export"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "Errors"
      + namespace                             = "AWS/Lambda"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:454671348950:cloudwatch-ok-action",
        ]
      + period                                = 60
      + region                                = "ca-central-1"
      + statistic                             = "Sum"
      + tags_all                              = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
      + threshold                             = 0
      + treat_missing_data                    = "notBreaching"
    }

  # module.platform_gc_design_system_export.aws_ssm_parameter.airtable_api_key will be created
  + resource "aws_ssm_parameter" "airtable_api_key" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/platform/gc-design-system/airtable-api-key"
      + region         = "ca-central-1"
      + tags_all       = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

  # module.platform_gc_design_system_export.module.platform_gc_design_system_export.aws_cloudwatch_event_rule.this will be created
  + resource "aws_cloudwatch_event_rule" "this" {
      + arn                 = (known after apply)
      + description         = "Triggers Lambda platform-gc-design-system-export on a schedule"
      + event_bus_name      = "default"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "platform-gc-design-system-export-schedule"
      + name_prefix         = (known after apply)
      + region              = "ca-central-1"
      + schedule_expression = "cron(0 0 1 1 ? 1970)"
      + tags                = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
      + tags_all            = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
    }

  # module.platform_gc_design_system_export.module.platform_gc_design_system_export.aws_cloudwatch_event_target.this will be created
  + resource "aws_cloudwatch_event_target" "this" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + force_destroy  = false
      + id             = (known after apply)
      + region         = "ca-central-1"
      + rule           = "platform-gc-design-system-export-schedule"
      + target_id      = "platform-gc-design-system-export"
    }

  # module.platform_gc_design_system_export.module.platform_gc_design_system_export.aws_ecr_lifecycle_policy.this[0] will be created
  + resource "aws_ecr_lifecycle_policy" "this" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep most recent 10 images"
                      + rulePriority = 10
                      + selection    = {
                          + countNumber = 10
                          + countType   = "imageCountMoreThan"
                          + tagStatus   = "any"
                        }
                    },
                ]
            }
        )
      + region      = "ca-central-1"
      + registry_id = (known after apply)
      + repository  = "platform-gc-design-system-export"
    }

  # module.platform_gc_design_system_export.module.platform_gc_design_system_export.aws_lambda_permission.this will be created
  + resource "aws_lambda_permission" "this" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "platform-gc-design-system-export"
      + id                  = (known after apply)
      + principal           = "events.amazonaws.com"
      + region              = "ca-central-1"
      + source_arn          = (known after apply)
      + statement_id        = "AllowExecutionFromEventBridge-platform-gc-design-system-export"
      + statement_id_prefix = (known after apply)
    }

  # module.platform_gc_design_system_export.module.platform_gc_design_system_export.module.this_lambda.aws_cloudwatch_log_group.this will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/platform-gc-design-system-export"
      + name_prefix       = (known after apply)
      + region            = "ca-central-1"
      + retention_in_days = 14
      + skip_destroy      = false
      + tags              = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
      + tags_all          = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
    }

  # module.platform_gc_design_system_export.module.platform_gc_design_system_export.module.this_lambda.aws_cloudwatch_query_definition.lambda_statistics will be created
  + resource "aws_cloudwatch_query_definition" "lambda_statistics" {
      + id                  = (known after apply)
      + log_group_names     = [
          + "/aws/lambda/platform-gc-design-system-export",
        ]
      + name                = "Lambda Statistics / platform-gc-design-system-export"
      + query_definition_id = (known after apply)
      + query_string        = <<-EOT
            filter @type = “REPORT”
            | stats
            count(@type) as countInvocations,
            count(@initDuration) as countColdStarts, (count(@initDuration)/count(@type))*100 as percentageColdStarts,
            max(@initDuration) as maxColdStartTime,
            avg(@duration) as averageDuration,
            max(@duration) as maxDuration,
            min(@duration) as minDuration,
            avg(@maxMemoryUsed) as averageMemoryUsed,
            max(@memorySize) as memoryAllocated, (avg(@maxMemoryUsed)/max(@memorySize))*100 as percentageMemoryUsed
            by bin(1h) as timeFrame
        EOT
      + region              = "ca-central-1"
    }

  # module.platform_gc_design_system_export.module.platform_gc_design_system_export.module.this_lambda.aws_iam_policy.non_vpc_policies[0] will be created
  + resource "aws_iam_policy" "non_vpc_policies" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "platform-gc-design-system-export_non_vpc"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                          + "logs:CreateLogGroup",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "CloudWatchAccess"
                    },
                  + {
                      + Action   = [
                          + "ecr:GetDownloadUrlForlayer",
                          + "ecr:BatchGetImage",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ecr:ca-central-1:454671348950:repository/platform-gc-design-system-export"
                      + Sid      = "ECRImageAccess"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags             = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
      + tags_all         = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
    }

  # module.platform_gc_design_system_export.module.platform_gc_design_system_export.module.this_lambda.aws_iam_policy.policies[0] will be created
  + resource "aws_iam_policy" "policies" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "platform-gc-design-system-export-0"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags             = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
      + tags_all         = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
    }

  # module.platform_gc_design_system_export.module.platform_gc_design_system_export.module.this_lambda.aws_iam_role.this will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "platform-gc-design-system-export"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.platform_gc_design_system_export.module.platform_gc_design_system_export.module.this_lambda.aws_iam_role_policy_attachment.attachments[0] will be created
  + resource "aws_iam_role_policy_attachment" "attachments" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "platform-gc-design-system-export"
    }

  # module.platform_gc_design_system_export.module.platform_gc_design_system_export.module.this_lambda.aws_iam_role_policy_attachment.lambda_insights[0] will be created
  + resource "aws_iam_role_policy_attachment" "lambda_insights" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/CloudWatchLambdaInsightsExecutionRolePolicy"
      + role       = "platform-gc-design-system-export"
    }

  # module.platform_gc_design_system_export.module.platform_gc_design_system_export.module.this_lambda.aws_iam_role_policy_attachment.non_vpc_policies[0] will be created
  + resource "aws_iam_role_policy_attachment" "non_vpc_policies" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "platform-gc-design-system-export"
    }

  # module.platform_gc_design_system_export.module.platform_gc_design_system_export.module.this_lambda.aws_lambda_function.this will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = [
          + "arm64",
        ]
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + function_name                  = "platform-gc-design-system-export"
      + id                             = (known after apply)
      + image_uri                      = "454671348950.dkr.ecr.ca-central-1.amazonaws.com/platform-gc-design-system-export:latest"
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 1024
      + package_type                   = "Image"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "ca-central-1"
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
      + tags_all                       = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
      + timeout                        = 300
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "AIRTABLE_API_KEY_PARAMETER_NAME" = "/platform/gc-design-system/airtable-api-key"
              + "AIRTABLE_BASE_ID"                = (sensitive value)
              + "AIRTABLE_TABLE_NAME"             = (sensitive value)
              + "GLUE_CRAWLER_NAME"               = "mock-crawler-name"
              + "S3_BUCKET_NAME_RAW"              = "cds-data-lake-raw-staging"
              + "S3_BUCKET_NAME_TRANSFORMED"      = "cds-data-lake-transformed-staging"
              + "S3_OBJECT_PREFIX"                = "platform/gc-design-system/airtable"
            }
        }

      + ephemeral_storage {
          + size = 512
        }

      + logging_config (known after apply)

      + tracing_config {
          + mode = "PassThrough"
        }

      + vpc_config {
          + ipv6_allowed_for_dual_stack = false
          + vpc_id                      = (known after apply)
        }
    }

Plan: 17 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["module.platform_gc_design_system_export.aws_cloudwatch_metric_alarm.platform_gc_design_system_error_logged"]
WARN - plan.json - main - Missing Common Tags: ["module.platform_gc_design_system_export.aws_cloudwatch_metric_alarm.platform_gc_design_system_errors"]
WARN - plan.json - main - Missing Common Tags: ["module.platform_gc_design_system_export.aws_ssm_parameter.airtable_api_key"]
WARN - plan.json - main - Missing Common Tags: ["module.platform_notify_export.aws_cloudwatch_metric_alarm.platform_gc_notify_error_logged"]
WARN - plan.json - main - Missing Common Tags: ["module.platform_notify_export.aws_cloudwatch_metric_alarm.platform_gc_notify_errors"]
WARN - plan.json - main - Missing Common Tags: ["module.platform_notify_export.aws_iam_policy.platform_notify_rds_snapshot_exports"]
WARN - plan.json - main - Missing Common Tags: ["module.platform_notify_export.aws_iam_role.platform_notify_rds_snapshot_exports"]
WARN - plan.json - main - Missing Common Tags: ["module.platform_notify_export.aws_kms_key.platform_notify_rds_snapshot_exports"]
WARN - plan.json - main - Missing Common Tags: ["module.platform_support_freshdesk_export.aws_cloudwatch_metric_alarm.platform_support_freshdesk_export_error_logged"]
WARN - plan.json - main - Missing Common Tags: ["module.platform_support_freshdesk_export.aws_cloudwatch_metric_alarm.platform_support_freshdesk_export_errors"]
WARN - plan.json - main - Missing Common Tags: ["module.platform_support_freshdesk_export.aws_ssm_parameter.freshdesk_api_key"]

30 tests, 19 passed, 11 warnings, 0 failures, 0 exceptions

```

</details>
